Repository: ahmedvstudio/invobay
Catalog: lib/l10n/intl_*.arb
Languages: ar

# appTitle
source: InvoBay
ar: إنفو باي

source: Welcome
ar: مرحبًا

source: Welcome To
ar: مرحبًا بك في

source: Search in stock
ar: البحث في المخزن

# itemStockLooksGood
source: Items stock looks good
ar: لا توجد مواد على وشك النفاذ

source: Low Stock Alert
ar: تنبيه بإنخفاض المخزون

source: is low on stock
ar: ‘‘منخفض المخزون

source: Out of Stock Alert
ar: تنبيه بنفاد المخزون

source: is out of stock
ar: ‘‘نفد من المخزون

# lowStockItemsWithCount
source: Low stock items: {count}
ar: عناصر المخزون المنخفض: {count}

source: Welcome back
ar: مرحبًا بعودتك

source: Inventory
ar: المخزن

source: Sell
ar: بيع

source: Buy
ar: شراء

# returns
source: Return
ar: إسترجاع

source: Receipts
ar: الفواتير

source: Reports
ar: التقارير

source: Settings
ar: الإعدادات

source: Stock Status
ar: حالة المخزون

source: No Low Stock
ar: لا توجد مواد على وشك النفاذ

source: No Out of Stock
ar: لا توجد مواد نافذة

source: Low Stock
ar: على وشك النفاذ

source: Out of Stock
ar: مواد نافذة

source: Name
ar: الاسم

source: Quantity
ar: الكمية

source: Buying Price
ar: سعر الشراء

source: Selling Price
ar: سعر البيع

source: Barcode
ar: الباركود

source: Description
ar: الوصف

source: Item Unit
ar: الوحدة

source: Stock
ar: المخزن

source: Price
ar: السعر

source: Clear Filters
ar: مسح الفلاتر

source: Clear All
ar: مسح الكل

source: Item Details
ar: تفاصيل العنصر

source: Show more
ar: عرض المزيد

source: Less
ar: أقل

source: Edit
ar: تعديل

source: Fix
ar: إصلاح

source: Receipt No
ar: رقم الفاتورة

source: Supplier
ar: المورد

source: Customer
ar: العميل

source: Loading
ar: جارٍ التحميل

source: Error loading supplier
ar: خطأ في تحميل المورد

source: Details
ar: تفاصيل

# receiptsAndSuppliers
source: Receipts & Suppliers
ar: الفواتير والموردين

source: data
ar: البيانات

source: More
ar: المزيد

source: Error
ar: خطأ

source: Add Item
ar: إضافة عنصر

source: Edit Item
ar: تعديل العنصر

source: Update Item
ar: تحديث العنصر

source: Low Stock Items
ar: مواد على وشك النفاذ

source: All items are in stock
ar: جميع العناصر متوفرة في المخزن

source: Notifications
ar: الإشعارات

source: Notification
ar: إشعار

source: Profile
ar: الملف الشخصي

source: Change Profile Picture
ar: تغيير صورة الملف الشخصي

source: Profile Information
ar: معلومات الملف الشخصي

source: Username
ar: اسم المستخدم

source: Personal Information
ar: المعلومات الشخصية

source: User ID
ar: معرف المستخدم

source: E-mail
ar: البريد الإلكتروني

source: Phone Number
ar: رقم الهاتف

source: Phone Number (Optional)
ar: رقم الهاتف (اختياري)

source: Gender
ar: الجنس

source: Date of Birth
ar: تاريخ الميلاد

source: Delete Account
ar: حذف الحساب

source: Account
ar: الحساب

source: Shop Settings
ar: إعدادات المتجر

source: Customers
ar: العملاء

source: Add Loyal Customers Details.
ar: أضف تفاصيل العملاء المخلصين.

source: Suppliers
ar: الموردون

source: Add Your Suppliers Details.
ar: أضف تفاصيل مورديك.

source: Vault / Expense
ar: الخزنة / المصاريف

source: Vault not found
ar: الخزنة غير موجودة.

source: Vault Balance
ar: رصيد الخزنة:

source: Total In
ar: الإجمالي الوارد

source: Total Out
ar: الإجمالي المصروف

source: Add Expense
ar: إضافة مصروفات

source: Add To Vault
ar: إضافة إلى الخزنة

source: Add Your Vault And Expense Details.
ar: أضف تفاصيل خزنتك ومصاريفك.

source: Shop Details
ar: تفاصيل المتجر

source: Add Shop Details.
ar: أضف تفاصيل المتجر.

source: App Settings
ar: إعدادات التطبيق

source: Appearance
ar: المظهر

source: Personalize The App To Your Liking.
ar: خصص التطبيق حسب رغبتك.

source: Set Any Kind Of Notification Message.
ar: ضبط رسائل الإشعارات.

source: Data Settings
ar: إعدادات البيانات

source: Sync Data
ar: مزامنة البيانات

source: Sync Data To The Cloud.
ar: مزامنة البيانات إلى السحابة.

source: Backup Data
ar: نسخ احتياطي للبيانات

source: Backup Data To Your Local Storage.
ar: نسخ احتياطي للبيانات إلى التخزين المحلي.

source: Load Data
ar: تحميل البيانات

source: Load Data From Your Local Storage.
ar: تحميل البيانات من التخزين المحلي.

source: Delete Data
ar: حذف البيانات

source: Delete Data From Your Local Storage.
ar: حذف البيانات من التخزين المحلي.

source: Logout
ar: تسجيل الخروج

source: Supplier Deleted Successfully
ar: تم حذف المورد بنجاح

source: Error Deleting Supplier
ar: حدث خطأ أثناء حذف المورد

source: Customer Deleted Successfully
ar: تم حذف العميل بنجاح

source: Error Deleting Customer
ar: حدث خطأ أثناء حذف العميل

source: Add new Customer
ar: إضافة عميل جديد

source: Add new Supplier
ar: إضافة مورد جديد

source: Edit Customer
ar: تعديل بيانات العميل

source: Edit Supplier
ar: تعديل بيانات المورد

source: Save Customer
ar: حفظ بيانات العميل

source: Save Supplier
ar: حفظ بيانات المورد

source: Update Customer
ar: تحديث بيانات العميل

source: Update Supplier
ar: تحديث بيانات المورد

source: Customer with this name already exists.
ar: يوجد عميل بهذا الاسم بالفعل.

source: Supplier with this name already exists.
ar: يوجد مورد بهذا الاسم بالفعل.

source: Street
ar: الشارع

source: City
ar: المدينة

source: State
ar: المحافظة

source: Country
ar: الدولة

source: Display
ar: اعدادات العرض

source: App Language.
ar: لغة التطبيق.

source: General
ar: اعدادات عامة

source: Currency.
ar: عملة المتجر.

source: Tax Percentage.
ar: نسبة الضريبة.

source: Low Stock Threshold.
ar: حد المخزون الادنى.

source: Theme:
ar: اعدادت الالوان:

source: System
ar: النظام

source: Light
ar: فاتح

source: Dark
ar: داكن

source: Save
ar: حفظ

source: Update
ar: تحديث

source: Shop Details Saved
ar: تم حفظ بيانات المتجر

# unit_piece
source: Piece
ar: قطعة

# unit_kg
source: KG
ar: كيلو

# unit_bag
source: Bag
ar: كيس

# unit_meter
source: Meter
ar: متر

# unit_liter
source: Liter
ar: لتر

# onBoardingFooterText
source: Stay organized and in control with a secure vault and much moreâ€”all in one app.
ar: ابق منظمًا وتحكم بكل سهولة مع خزنة آمنة والمزيد - كل ذلك في تطبيق واحد.

source: I agree to
ar: أوافق على

source: Privacy Policy
ar: سياسة الخصوصية

source: Terms of use
ar: شروط الاستخدام

source: and
ar: و

# continue1
source: Continue
ar: استمرار

# onBoardingHeaderText
source: Effortlessly manage your inventory with features for tracking:
ar: إدارة المخزون بسهولة مع ميزات لتتبع:

source: Page Not Found
ar: الصفحة غير موجودة

# noNotificationYet
source: No notifications yet.
ar: لا توجد إشعارات بعد.

source: Are you sure you want to delete all notifications?
ar: هل أنت متأكد من حذف جميع الإشعارات؟

source: Sell Checkout Successful
ar: عملية البيع تمت بنجاح

source: Buy Checkout Successful
ar: عملية الشراء تمت بنجاح

source: Return Checkout Successful
ar: عملية الاسترجاع تمت بنجاح

source: Sell Checkout
ar: إتمام البيع

source: Buy Checkout
ar: إتمام الشراء

source: Return Checkout
ar: إتمام الإسترجاع

source: Total
ar: الإجمالي

source: About
ar: حول التطبيق

# appInfoAndUpdate
source: Application Info And Update.
ar: معلومات التطبيق والتحديث.

source: Open Source License
ar: تراخيص مفتوحة المصدر

source: Check For Update
ar: تحقق من التحديثات

source: Version
ar: الإصدار

source: Error getting app version:
ar: خطأ في جلب إصدار التطبيق:

source: Failed to load version
ar: فشل تحميل الإصدار

source: Encryption Key
ar: مفتاح التشفير

source: Are you sure you want to delete all data?
ar: هل أنت متأكد من حذف جميع البيانات؟

# profitAndLossStatement
source: Profit & Loss Statement
ar: بيان الأرباح والخسائر

source: Gross Revenue
ar: الإيرادات الإجمالية

source: COGS
ar: (تكلفة البضاعة المباعة) COGS

source: Return Loss
ar: خسائر الإسترجاع

source: Profit Margin
ar: هامش الربح

source: Sales vs Purchases
ar: المبيعات بالنسبة للمشتريات

source: Summary
ar: الملخص

source: Inventory Value
ar: قيمة المخزن

source: Sales
ar: المبيعات

source: Expenses
ar: الصرفيات

source: Profit / Loss
ar: الربح / الخسارة

source: change range
ar: تغيير المدة

source: From
ar: من

source: To
ar: إلى

source: Sales by Payment Method
ar: المبيعات حسب طريقة الدفع

source: Tax Collected
ar: مبلغ الضريبة المحصلة

source: Error loading payment methods:
ar: خطأ في تحميل طرق الدفع:

source: Error loading tax:
ar: خطأ في تحميل الضريبة:

source: Top Suppliers
ar: أفضل الموردين

source: Supplier Debts
ar: ديون للموردين

source: Debt
ar: دين

source: Most Bought Items
ar: العناصر الأكثر شراءً

source: Average Cost Per Item
ar: متوسط تكلفة العنصر الواحد

source: Avg Cost
ar: متوسط التكلفة

source: Qty
ar: الكمية

source: No data available.
ar: .لا توجد بيانات متاحة

source: New Stock Items
ar: عناصر مضافة حديثاً

source: Out of Stock Items
ar: عناصر نافذة من المخزن

source: No items to display.
ar: لا توجد عناصر للعرض.

source: Most returned items
ar: العناصر الأكثر إسترجاعًا

source: No returned items found.
ar: لم يتم العثور على عناصر مُعادة.

source: returned
ar: تم إرجاعه

source: pcs
ar: قطع

source: Top Costumers
ar: أفضل العملاء

source: Customer Debts
ar: ديون العملاء

source: Most Sold Items
ar: العناصر الأكثر مبيعًا

source: No debtors found.
ar: لا يوجد مدينون.

source: No items sold yet.
ar: لم يتم بيع أي عناصر بعد.

source: Qty Sold
ar: الكمية المباعة

source: Top
ar: الأفضل

source: Checkout Review
ar: مراجعة الدفع

source: Exceed total amount
ar: تجاوز المبلغ الإجمالي

source: Checkout
ar: الدفع

source: Add Fees
ar: إضافة رسوم

source: Customer Address
ar: عنوان العميل

source: Supplier Address
ar: عنوان المورد

source: Change
ar: تغيير

# selectCustomer
source: Select a Customer
ar: اختر عميلًا

# selectSupplier
source: Select a Supplier
ar: اختر موردًا

source: Subtotal
ar: المجموع الاولي

source: Discount
ar: الخصم

source: Shipping Fee
ar: رسوم الشحن

source: Tax Fee
ar: رسوم الضريبة

source: Order Total
ar: إجمالي الطلب

source: Paid Amount
ar: المبلغ المدفوع

source: Debt Amount
ar: مبلغ الدين

source: Select Payment Method
ar: اختر طريقة الدفع

source: Payment Method
ar: طريقة الدفع

# discountPercentHere
source: Discount % here.
ar: % الخصم هنا

source: Discount amount here.
ar: مبلغ الخصم هنا

# enterValidNumber
source: Enter a valid number
ar: أدخل رقمًا صحيحًا

source: Percentage cannot exceed 100%
ar: النسبة لا يمكن أن تتجاوز 100%

source: Discount cannot exceed subtotal
ar: الخصم لا يمكن أن يتجاوز المجموع الاولي

source: Apply
ar: تطبيق

source: Undo
ar: تراجع

source: Search and Add Items
ar: ابحث وأضف عناصر

source: Item not found!
ar: العنصر غير موجود!

source: Cart
ar: السلة

source: Proceed to checkout
ar: المتابعة إلى الدفع

source: Your list is Empty!
ar: قائمتك فارغة!

source: removed
ar: تم ازالته

source: Receipt Details
ar: تفاصيل الفاتورة

source: Bought Items
ar: العناصر المشتراة

source: Item removed from inventory
ar: تم إزالة العنصر من المخزن

source: Loading item...
ar: ...جارٍ تحميل العنصر

source: Are you sure you want to delete this receipt?
ar: هل أنت متأكد من حذف هذا الفاتورة؟

source: Error loading receipt details
ar: خطأ في تحميل تفاصيل الفاتورة

source: Error loading shop details
ar: خطأ في تحميل تفاصيل المتجر

source: Buy Receipts
ar: فواتير الشراء

source: Done
ar: تم

source: selected
ar: تم الاختيار

# areYouSureYouWantToDeleteWithCount
source: Are you sure you want to delete {count} receipt(s)?
ar: هل أنت متأكد من حذف ؟{count} الفاتورة(فواتير)

source: Sold Items
ar: العناصر المباعة

source: Returned Items
ar: العناصر المعادة

source: Return Receipts
ar: فواتير الإسترجاع

source: Sell Receipts
ar: فواتير البيع

source: Scan QR Code
ar: مسح QR كود

source: New Payment
ar: دفعة جديدة

source: Status
ar: الحالة

source: Date
ar: التاريخ

source: Subtotal Price
ar: السعر الاولي

source: Unknown Customer
ar: عميل غير معروف

source: Error loading customer
ar: خطأ في تحميل العميل

source: Unknown Supplier
ar: مورد غير معروف

source: Completed
ar: مكتمل

source: Pending
ar: غير مسددة

source: Confirm Deletion
ar: تأكيد الحذف

source: Are you sure you want to delete this?
ar: هل انت متاكد من حذف هذا؟

source: Are you sure you want to delete this customer?
ar: هل انت متاكد من حذف هذا العميل؟

source: Are you sure you want to delete this supplier?
ar: هل انت متاكد من حذف هذا المورد؟

source: Cancel
ar: الغاء

source: Delete
ar: حذف

source: Change Discount Type
ar: تغيير نوع الخصم

# switchBetweenPercentageFixedAmount
source: Switch between percentage and fixed amount.
ar: التبديل بين النسبة المئوية او مبلغ الثابت

source: Percentage %
ar: نسبة مئوية %

source: Amount
ar: مبلغ ثابت

source: Customer added successfully
ar: تم اضافة العميل بنجاح

source: Enter customer name
ar: أدخل اسم العميل

# pleaseEnterName
source: Please enter a name
ar: الرجاء ادخال الاسم

source: Add
ar: إضافة

source: Error Adding Customer
ar: خطأ باضافة العميل

source: Add New Item
ar: إضافة عنصر جديد

source: Please fill all the fields correctly
ar: يرجى ملء جميع الحقول بشكل صحيح

source: Item added successfully
ar: تم اضافة العنصر بنجاح

source: Supplier added successfully
ar: تم اضافة المورد بنجاح

source: Enter supplier name
ar: ادخل اسم المورد

source: Error adding supplier
ar: خطأ باضافة المورد

source: Add Quantity
ar: اضافة كمية

source: Enter Quantity
ar: ادخل الكمية

source: Checkout Summary
ar: ملخص العملية

source: Confirm
ar: تأكيد

source: Total Amount
ar: المبلغ الكلي

source: Item Receipts Details
ar: تفاصيل فواتير العنصر

source: No receipts found.
ar: لا توجد فواتير.

source: Error loading receipts
ar: خطا في تحميل الفواتير.

source: More Info
ar: معلومات اضافية

source: Buying Total
ar: مجموع الشراء

source: Selling Total
ar: مجموع البيع

source: Close
ar: إغلاق

source: Update Buying Price
ar: تحديث سعر الشراء

source: Receipts with higher buying prices:
ar: فواتير بسعر شراء اعلى:

source: New Buying Price
ar: سعر الشراء الجديد

source: Invalid Price
ar: المبلغ غير صالح

source: Should Be Greater Than Current Buying Price.
ar: يجب ان يكون اعلى من سعر الشراء الحالي

source: Update Selling Price
ar: تحديث سعر البيع

source: Selling price must be greater than buying Price.
ar: يجب ان يكون سعر البيع اكبر من سعر الشراء

source: New Selling Price
ar: سعر البيع الجديد

source: Enter new selling price
ar: ادخل سعر البيع

# pleaseEnterValidPriceGreaterThanBuyingPrice
source: Please enter a valid price greater than buying price.
ar: الرجاء إدخال سعر صالح اكبر من سعر الشراء.

source: Select Receipt Type
ar: اختر نوع الفاتورة

source: Enter Values
ar: ادخل قيم

source: Invalid quantity.
ar: الكمية غير صالحة

# invalidQuantityEnterNumberWithMaxDecimals
source: Enter a number with max 2 decimals.
ar: أدخل رقمًا بحد أقصى 2 أرقام عشرية.

source: No items found
ar: لا توجد مواد

source: Not found!
ar: غير موجود!

source: Your Inventory is Empty
ar: المخزن فارغ

source: No returnable items found
ar: لا توجد مواد قابلة للاسترجاع

source: Select App Language
ar: اختر لغة التطبيق

source: Select Currency
ar: اختر عملة المتجر

source: No currencies found.
ar: العملة غير موجودة!

source: Currency updated to
ar: تم تحديث العملة الى

source: Change Encryption Key
ar: تغيير رمز التشفير

# mustBeCharacterLong
source: Must be 32 character long.
ar: يحب ان يكون 32 رمز

source: Encryption key updated!
ar: تم تحديث رمز التشفير!

source: Threshold Value
ar: ادخل قيمة الحد الأدنى للمخزون

# warningWhenStockThreshold
source: warning when stock â‰¤ threshold
ar: للتنبيه عند وصول الى القيمة المحددة

# enterValidPositiveNumber
source: Enter a valid positive number.
ar: ادخل رقم موجب.

# lowStockThresholdUpdatedSaved
source: Low stock threshold updated and saved
ar: تم تحديث قيمة الحد الادنى.

source: Notification Settings
ar: اعدادت الاشعارات

source: All Notifications
ar: كل الاشعارات

source: Edit Tax Percentage
ar: تعديل نسبة الضريبة

source: Tax %
ar: الضريبة %

source: Enter tax percentage
ar: ادخل نسبة الضريبة

# taxPercentageUpdatedSaved
source: Tax percentage updated and saved
ar: تم حفظ نسبة الضريبة

source: Edit Expense
ar: تعديل الصرف

source: Edit Addition
ar: تعديل الاضافة

source: This will permanently delete this transaction.
ar: سوف يتم حذف هذه الحركة بالكامل.

source: Note (optional)
ar: الملاحظات (اختياري)

source: Edit Vault Balance
ar: تعديل مبلغ الخزنة

# pleaseEnterAmount
source: Please enter an amount
ar: الرجاء ادخال المبلغ

source: Customer Action
ar: اعدادات العميل

source: Supplier Action
ar: اعدادات المورد

source: Call
ar: إتصال

source: Shop Name
ar: اسم المكتب

source: Edit Sale Payment
ar: تعديل دفعة البيع

source: Edit Buy Payment
ar: تعديل دفعة الشراء

source: Edit Return Payment
ar: تعديل دفعة الاسترجاع

source: Today
ar: اليوم

source: Yesterday
ar: امس

source: Last Week
ar: الاسبوع الماضي

source: This Month
ar: هذا الشهر

source: Older
ar: أقدم

source: In Stock
ar: في المخزن

# outOfStock2
source: Out of Stock
ar: نفذ من المخزون

source: OK
ar: تم

source: Creating backup...
ar: جاري عمل نسخة احتياطية...

source: Backup complete!
ar: تم انشاء نسخة احتياطية

source: Backup failed
ar: فشل انشاء نسخة احتياطية

source: Restore cancelled.
ar: تم الغاء الاسترجاع

# invalidBackupFilePleaseSelectInvobakFile
source: Invalid backup file. Please select a .invobak file.
ar: ملف غير صالح, الرجاء اختيار ملف بإمتداد invobak.

source: Restoring...
ar: جاري استرجاع الملفات...

# encryptionKeyMustBe32
source: Encryption key must be 32 characters for AES-256.
ar: يجب ان يحتوي مفتاح التشفير على 32 رمز

# restoreCompleteRestarting
source: Restore complete! Restarting in
ar: تم الاسترجاع بنجاح. جاري التحميل

source: Restore failed:
ar: فشل الاسترجاع:

source: Restarting in
ar: إعادة تشغيل التطبيق في

source: *Must restart the app for changes to take effect
ar: *يجب اعادة تشغيل التطبيق لضمان العمل بصورة صحيحة

source: Cash
ar: نقداً

source: MasterCard
ar: ماستر كارد

source: Bank Transfer
ar: حوالة مصرفية

# completedSuccessfullyWithTotal
source: Completed successfully With Total: {count}
ar: العملية تمت بنجاح بإجمالي: {count}

# lowStockItemWithQuantity
source: {itemName} is low on stock ({count} left).
ar: العنصر {itemName} بقي منه {count} فقط

# outOfStockItemWithName
source: {itemName} is out of stock.
ar: {itemName} نفذ من المخزون.

source: This field is required
ar: هذا الحقل مطلوب

source: Success
ar: عملية ناجحة

source: Receipt saved successfully
ar: تم حفظ الفاتورة بنجاح

source: This is the first version of the app.
ar: هذا هو الإصدار الأول من التطبيق.
